---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SharedParameterElement
source: html/c6280bdf-81ea-5a41-07ad-b93092b5a470.htm
---
# SharedParameterElement Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.